# Panda 2

## Partie A — Débutants
1. Charger `customers_dirty.csv` et afficher le nombre de lignes et colonnes.

In [76]:
import pandas as pd

df = pd.read_csv('./data/customers_dirty.csv')
dfc = pd.read_csv('./data/customers_dirty copy.csv')
df.shape

(5, 4)

In [77]:
df

   id     name   age       city
0   1    Alice  25.0      paris
1   2      Bob   NaN       LYON
2   3  Charlie  40.0  Marseille
3   4    Alice  25.0      paris
4   5    Ethan  32.0        NaN

2. Vérifier combien de valeurs manquantes par colonne.

In [78]:
df.isna().sum()

id      0
name    0
age     1
city    1
dtype: int64

3. Supprimer toutes les lignes avec des valeurs manquantes.

In [79]:
dfc_clean = dfc.dropna(how='any')
dfc_clean

   id     name   age       city
0   1    Alice  25.0      paris
2   3  Charlie  40.0  Marseille
3   4    Alice  25.0      paris

4. Remplacer les valeurs manquantes d’âge par la moyenne des âges.

In [80]:
mean_age = df['age'].mean()
df['age'] = df['age'].fillna(mean_age)
df

   id     name   age       city
0   1    Alice  25.0      paris
1   2      Bob  30.5       LYON
2   3  Charlie  40.0  Marseille
3   4    Alice  25.0      paris
4   5    Ethan  32.0        NaN

5. Uniformiser la colonne `city` (première lettre en majuscule).

In [81]:
df['city'] = df['city'].str.capitalize()
dfc['city'] = dfc['city'].str.capitalize()
df

   id     name   age       city
0   1    Alice  25.0      Paris
1   2      Bob  30.5       Lyon
2   3  Charlie  40.0  Marseille
3   4    Alice  25.0      Paris
4   5    Ethan  32.0        NaN

6. Supprimer les doublons.

In [85]:
dfd = df.drop_duplicates(subset=['name', 'age', 'city'])
df = df.drop_duplicates(subset=['name', 'age', 'city'])
# dfd
df

   id     name   age       city  is_adult
0   1    Alice  25.0      Paris      True
1   2      Bob  30.5       Lyon      True
2   3  Charlie  40.0  Marseille      True
4   5    Ethan  32.0        NaN      True

*(Optionnel)* Compter le nombre de clients uniques par ville.


## Partie B — Challenge
7. Créer une nouvelle colonne `is_adult` (âge >= 18).

In [86]:
# df['is_adult'] = df['age'] > 18
# df
df.loc[:, "is_adult"] = df["age"] > 18
df

   id     name   age       city  is_adult
0   1    Alice  25.0      Paris      True
1   2      Bob  30.5       Lyon      True
2   3  Charlie  40.0  Marseille      True
4   5    Ethan  32.0        NaN      True

8. Récupérer depuis `marketing.db` le nombre de commandes par client.

9. Fusionner ce résultat avec le CSV nettoyé.

10. Créer une colonne `fidelite` : "fidèle" si nb_commandes > 1, sinon "nouveau".

11. Exporter le résultat final dans `data/customers_clean.csv`.

*(Optionnel)* Lister les 3 clients les plus fidèles.